In [7]:
-- Daj tam cele cislo/int 1
-- Jednoriadkovy komentar v jazyku SQL
select 1;
-- Daj tam retazec/varchar Ahoj svet
select "Ahoj svet";
-- Daj tam float/real 999.99 
select 999.99;
-- Daj tam date/datum
select "2022-10-3";

,2022-10-3
0,2022-10-3

In [11]:
-- Zoznam vsetkych databaz
show databases;
-- Zoznam vsetkych tabuliek
show tables;
-- Zoznam vsetkych pouzitelov
show users;
show views;

,Tables_in_Kurz_SQL
0,Album
1,City
2,DEPT
3,Data_SQLZoo_Nobel_csv
4,Data_SQLZoo_World_csv
5,EMP
6,T1
7,T10
8,T100
9,World
10,world_csv

In [15]:
-- Vypis nazov db, na ktoru si pripojeny
select DATABASE();
use Kurz_SQL;
select DATABASE();

,DATABASE()
0,Kurz_SQL

In [22]:
-- select * from World;
-- select name, area, population from World;
-- select area, area/1000, population, name  from World;
-- Verzia MySQL
select @@version;

,@@version
0,5.7.34-37-log

In [29]:
-- Operacie aritmeticke + - / *
select 10-20;
-- Delenie realne
select 5/2;
-- Delenie celociselne
select 5 div 2;
-- Delenie so zvyskom/modulo
select 5 % 2;
select 5.0 / 0.0;

,5.0 / 0.0
0,None

In [31]:
-- describe World;
show columns from World;

,Field,Type,Null,Key,Default,Extra
0,name,varchar(32),YES,,None,
1,continent,varchar(13),YES,,None,
2,area,int(11),YES,,None,
3,population,int(11),YES,,None,
4,gdp,varchar(11),YES,,None,
5,capital,varchar(25),YES,,None,
6,tld,varchar(3),YES,,None,
7,flag,varchar(94),YES,,None,